app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC