app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."deadline" DESC
---
  def index
    @tasks = Task.all.order(deadline: :desc)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @task = Task.find_by(id: params[:id])

INSERT INTO "tasks" ("content", "created_at", "updated_at", "deadline", "tag") VALUES (?, ?, ?, ?, ?)  [["content", "部屋片づけ"], ["created_at", "2024-09-13 05:14:59.872852"], ["updated_at", "2024-09-13 05:14:59.872852"], ["deadline", "2024-09-13 18:00:00"], ["tag", nil]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "tasks" SET "content" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["content", "基本情報:P208～216"], ["updated_at", "2024-09-06 04:25:12.780215"], ["id", 2]]
---
  def update
    @task = Task.find_by(id: params[:id])

    if @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 8]]
---
  def destroy
    @task = Task.find_by(id: params[:id])
    @task.destroy